In [1]:
import pandas as pd

In [18]:
df1 = pd.DataFrame({'A': ['A0', 'A1'],
                        'B': ['B0', 'B1']},
                        index=[0, 1])

In [19]:
df2 = pd.DataFrame({'A': ['A2', 'A3'],
                        'B': ['B2', 'B3']},
                         index=[2, 3])

In [20]:
df3 = pd.DataFrame({'A': ['A4', 'A5'],
                        'B': ['B4', 'B5']},
                        index=[4,5])

In [21]:
df1

    A   B
0  A0  B0
1  A1  B1

In [22]:
df2

    A   B
2  A2  B2
3  A3  B3

In [23]:
df3

    A   B
4  A4  B4
5  A5  B5

CONCATENA::

In [24]:
pd.concat([df1,df2,df3])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5

In [25]:
pd.concat([df1,df2,df3], axis=1)

     A    B    A    B    A    B
0   A0   B0  NaN  NaN  NaN  NaN
1   A1   B1  NaN  NaN  NaN  NaN
2  NaN  NaN   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4
5  NaN  NaN  NaN  NaN   A5   B5

In [28]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [30]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [31]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

Mesclar::

In [33]:
pd.merge(esquerda,direita, how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [34]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [35]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [36]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [37]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [39]:
esquerda.join(direita, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3